H =[]

data = [-0.002278481,0.012278481,9.793607595;
        1.328224299 , 7.557570093,-1.176448598;
        1.214431818 , -3.623977273, -9.422954545;
        -7.501473684,-1.686526316,1.3;
        12.02207317 ,-2.234756098,-0.638414634;
        1.142417582,-11.64846154,2.235164835
        ];    %6次加速度计的数据 shape = (6,3)

for i = 1:6 %矩阵填充
    Hi = [1,0,0,data(i,:),0,0,0,0,0,0;
         0,1,0,0,0,0,data(i,:),0,0,0;
         0,0,1,0,0,0,0,0,0,data(i,:)];
         H = [H;Hi];
end
z = reshape(data.',[18,1]);

x = (H.'*H)\H.'*z %最小二乘估计 inv(H.'*H)*H.'*z

A = reshape(x(4:12),[3,3]); %校准矩阵 

zero_bias = x(1:3); %零偏

a_better =[] ;

for i = 1:6  %对6组数据进行校准 inv(A) * (data(i,:).' - zero_bias ) 
    a_temp = A \ (data(i,:).' - zero_bias ) ;
    a_better = [a_better;a_temp.'];
end
    
a_better
data
error = data - a_better

plot(error)
title('误差')
 





